using IDA_C_sh_HomeWork;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace IDA_C_sh_HomeWork_4
{
    internal class Trombon : MusicalTool
    {
        public Trombon()
        {
            Name_ = "Trombon";
            Desc_ = "Eвропейский духовой амбушюрный инструмент. Входит в оркестровую группу медных духовых музыкальных инструментов басово-тенорового регистра.";
            Sound_ = "boo boo boo (beatyfull sound of trombon)";
            History_ = "Появление тромбона относится к XV веку. Принято считать, что непосредственными предшественниками этого инструмента были кулисные трубы, при игре на которых у музыканта была возможность передвигать трубку инструмента, таким образом получая хроматический звукоряд. Такие трубы использовались для удвоения голосов церковного хора, учитывая сходство тембра трубы с человеческим голосом. Нужно только было достичь сходства интонации, для чего и сделали кулису, дающую хроматизм и вибрато[источник не указан 1646 дней].\r\n\r\nЗа время своего существования тромбон практически не претерпел радикальных изменений в своей конструкции.";
        }
    }
}
