using IDA_C_sh_HomeWork;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace IDA_C_sh_HomeWork_4
{
    internal class Ukulele : MusicalTool
    {
        public Ukulele() 
        {
            Name_ = "Ukulele";
            Desc_ = "Standart 4-string ukulele";
            Sound_ = "drin drin drin (beatyfull sound of ukulele)";
            History_ = "Укулеле появилась на Гавайских островах во второй половине XIX века, куда её, под названием машети да браса (порт. machete da braça), завезли португальцы с острова Мадейра. Первый магазин по продаже укулеле на Гавайях был открыт в 1880 году Мануэлем Нуньесом (1843−1922). Гавайцы используют укулеле для исполнения сентиментальных песен на английском языке и музыки в «гавайском стиле»[4].\r\n\r\nНазвание инструмента (гав. ʻukulele) переводится как «скачущая блоха»[1] — то, на что похожи быстрые движения правой руки при игре на укулеле[5]. Учитывая, что прежде чем попасть на Гавайи, родственная укулеле маленькая гитара кавакинью в XV веке была завезена португальцами в Африку[6], возможно что это название как-то связано со словом укулеле из южно-африканского (кафрского) языка коса (уку — инфинитивная частица, подобная англ. to + леле — глагол «спать»), смысл которого хорошо передаёт мечтательное и задумчивое настроение, вызываемое звуками укулеле.";
        }
    }
}
