using IDA_C_sh_HomeWork;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace IDA_C_sh_HomeWork_4
{
    internal class Violoncello : MusicalTool
    {
        public Violoncello() 
        {
            Name_ = "Violoncello";
            Desc_ = "уменьшит.-ласкат. от violone — «контрабасик; маленький контрабас», образованного от viola) — смычковый музыкальный инструмент с 4-мя струнами, настроенными по квинтам: Cб Gб Dм Aм. По высоте звучания занимает промежуточное положение между более высоким альтом и низким контрабасом.";
            Sound_ = "vzhu - vzhu - vzhu (beatyfull sound of Violoncello)";
            History_ = "Появление виолончели относится к началу XVI века. Первоначально она применялась как басовый инструмент для сопровождения пения (или исполнения на инструменте более высокого регистра). Существовали многочисленные разновидности виолончели, отличавшиеся друг от друга размерами, количеством струн, строем (чаще всего встречалась настройка на тон ниже современной).\r\n\r\nВ XVII—XVIII веках усилиями выдающихся музыкальных мастеров итальянских школ (Николо Амати, Джузеппе Гварнери, Антонио Страдивари, Карло Бергонци, Доменико Монтаньяна) была создана классическая модель виолончели с твёрдо устоявшимся размером корпуса. В конце XVII века появились первые сольные произведения для виолончели ― сонаты и ричеркары Доменико Габриелли. К середине XVIII века виолончель начала использоваться как концертный инструмент, и благодаря более яркому, полному звуку и улучшающейся технике исполнения окончательно вытеснила из музыкальной практики виолу да гамба. Виолончель также входит в состав симфонического оркестра и камерных ансамблей. Окончательное утверждение виолончели как одного из ведущих инструментов в музыке произошло в XX веке усилиями выдающегося музыканта Пабло Казальса. Развитие школ исполнения на этом инструменте привело к появлению многочисленных виолончелистов-виртуозов, регулярно выступающих с сольными концертами.\r\n\r\nРепертуар виолончели весьма широк и включает многочисленные концерты, сонаты, сочинения без сопровождения.";

        }
    }
}
